```
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.external.git: Refreshing state... [id=-]
module.aws_organization.random_string.random: Refreshing state... [id=si38]
module.aws_organization.aws_organizations_account.account: Refreshing state...
module.aws_organization.aws_organizations_account.account: Refreshing state... [id=656889719924]
module.serverless_api["example"].module.repository.github_repository.repository: Refreshing state... [id=serverless-example-api]
module.aws_logging.data.aws_caller_identity.current: Refreshing state... [id=2020-09-06 14:35:42.86330646 +0000 UTC]
module.dns.module.dns["live"].aws_acm_certificate.apex: Refreshing state... [id=arn:aws:acm:us-east-1:656889719924:certificate/2d620bca-b6a9-4c69-b045-9874dcbf5f30]
module.aws_logging.data.aws_region.current: Refreshing state... [id=us-east-1]
module.aws_logging.data.aws_partition.current: Refreshing state... [id=2020-09-06 14:35:42.715736139 +0000 UTC]
module.dns.aws_route53_delegation_set.main: Refreshing state... [id=N00248303TX9WWXC3DUAK]
module.aws_api_gateway.aws_iam_role.api_gateway_cloudwatch: Refreshing state... [id=api-gateway-cloudwatch]
module.aws_logging.aws_s3_bucket.logs: Refreshing state... [id=scaffoldly-si38-logs-cloudtrail]
module.dns.module.dns["live"].aws_acm_certificate.subdomain_wildcard: Refreshing state... [id=arn:aws:acm:us-east-1:656889719924:certificate/345cace1-2d73-4acc-a44f-d45752deb801]
module.dns.module.dns["nonlive"].aws_acm_certificate.subdomain_wildcard: Refreshing state... [id=arn:aws:acm:us-east-1:656889719924:certificate/46955869-b3c7-4936-b463-5caea37eb3f5]
module.dns.module.dns["nonlive"].aws_acm_certificate.apex: Refreshing state... [id=arn:aws:acm:us-east-1:656889719924:certificate/8135d581-d413-41d4-986c-d9ce3a96a52a]
module.aws_logging.data.aws_iam_policy_document.bucket_policy: Refreshing state... [id=2777606739]
module.aws_logging.aws_kms_key.cloudtrail: Refreshing state... [id=f206c800-14d0-4612-86cd-bd6b80b2045e]
module.dns.module.dns["live"].aws_route53_zone.zone: Refreshing state... [id=Z09171243VWGB0AD4XJAE]
module.dns.module.dns["nonlive"].aws_route53_zone.zone: Refreshing state... [id=Z09185361UA62H9QOZ65H]
module.aws_api_gateway.aws_iam_role_policy.api_gateway_cloudwatch: Refreshing state... [id=api-gateway-cloudwatch:default]
module.aws_api_gateway.aws_api_gateway_account.account: Refreshing state... [id=api-gateway-account]
module.aws_logging.aws_cloudtrail.cloudtrail: Refreshing state... [id=cloudtrail]
module.dns.module.dns["live"].aws_route53_record.verification_record["scaffold.ly"]: Refreshing state... [id=Z09171243VWGB0AD4XJAE__7442a2ae3c77e4c5d4bdc09c99cb7fd4.scaffold.ly._CNAME]
module.dns.module.dns["nonlive"].aws_route53_record.verification_record["scaffoldly.dev"]: Refreshing state... [id=Z09185361UA62H9QOZ65H__5d42b6204724f370284a161fa6ef6dab.scaffoldly.dev._CNAME]
module.aws_api_gateway.module.domain["nonlive"].aws_api_gateway_domain_name.domain: Refreshing state... [id=api.scaffoldly.dev]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_rest_api.api: Refreshing state... [id=fghfrn4x2b]
module.serverless_api["example"].module.stage["nonlive"].aws_cloudwatch_log_group.group: Refreshing state... [id=/aws/apigateway/example-nonlive]
module.serverless_api["example"].module.stage["live"].aws_cloudwatch_log_group.access_logs_group: Refreshing state... [id=/aws/apigateway/example-live-access-logs]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_rest_api.api: Refreshing state... [id=twevug835e]
module.aws_api_gateway.module.domain["live"].aws_api_gateway_domain_name.domain: Refreshing state... [id=api.scaffold.ly]
module.serverless_api["example"].module.stage["live"].aws_cloudwatch_log_group.group: Refreshing state... [id=/aws/apigateway/example-live]
module.serverless_api["example"].module.stage["nonlive"].aws_cloudwatch_log_group.access_logs_group: Refreshing state... [id=/aws/apigateway/example-nonlive-access-logs]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_resource.health: Refreshing state... [id=0dnh87]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_gateway_response.response_cors: Refreshing state... [id=aggr-fghfrn4x2b-DEFAULT_4XX]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_gateway_response.response_cors: Refreshing state... [id=aggr-twevug835e-DEFAULT_4XX]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_resource.health: Refreshing state... [id=iwx47u]
module.serverless_api["example"].module.stage["nonlive"].aws_cloudwatch_log_group.execution_group: Refreshing state... [id=API-Gateway-Execution-Logs_fghfrn4x2b/nonlive]
module.serverless_api["example"].module.stage["live"].aws_cloudwatch_log_group.execution_group: Refreshing state... [id=API-Gateway-Execution-Logs_twevug835e/live]
module.aws_api_gateway.module.domain["live"].aws_route53_record.api_record: Refreshing state... [id=Z09171243VWGB0AD4XJAE_api.scaffold.ly_A]
module.aws_api_gateway.module.domain["nonlive"].aws_route53_record.api_record: Refreshing state... [id=Z09185361UA62H9QOZ65H_api.scaffoldly.dev_A]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_method.health_get: Refreshing state... [id=agm-fghfrn4x2b-0dnh87-GET]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_method.health_get: Refreshing state... [id=agm-twevug835e-iwx47u-GET]
module.aws_logging.aws_s3_bucket_public_access_block.logs: Refreshing state... [id=scaffoldly-si38-logs-cloudtrail]
module.aws_logging.aws_s3_bucket_policy.bucket_policy: Refreshing state... [id=scaffoldly-si38-logs-cloudtrail]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_method_response.health_get_response_200: Refreshing state... [id=agmr-fghfrn4x2b-0dnh87-GET-200]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_integration.health_get: Refreshing state... [id=agi-twevug835e-iwx47u-GET]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_method_response.health_get_response_200: Refreshing state... [id=agmr-twevug835e-iwx47u-GET-200]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_integration.health_get: Refreshing state... [id=agi-fghfrn4x2b-0dnh87-GET]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_integration_response.health_get_response_200: Refreshing state... [id=agir-fghfrn4x2b-0dnh87-GET-200]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_integration_response.health_get_response_200: Refreshing state... [id=agir-twevug835e-iwx47u-GET-200]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_deployment.deployment: Refreshing state... [id=y4zlgw]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_deployment.deployment: Refreshing state... [id=qh1vo4]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_stage.stage: Refreshing state... [id=ags-twevug835e-live]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_stage.stage: Refreshing state... [id=ags-fghfrn4x2b-nonlive]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_base_path_mapping.mapping: Refreshing state... [id=api.scaffoldly.dev/example]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_method_settings.settings: Refreshing state... [id=twevug835e-live-*/*]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_base_path_mapping.mapping: Refreshing state... [id=api.scaffold.ly/example]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_method_settings.settings: Refreshing state... [id=fghfrn4x2b-nonlive-*/*]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.serverless_api["example"].module.stage["live"].aws_api_gateway_base_path_mapping.mapping will be created
  + resource "aws_api_gateway_base_path_mapping" "mapping" {
      + api_id      = (known after apply)
      + base_path   = "example"
      + domain_name = "api.scaffold.ly"
      + id          = (known after apply)
      + stage_name  = "live"
    }

  # module.serverless_api["example"].module.stage["live"].aws_api_gateway_deployment.deployment must be replaced
+/- resource "aws_api_gateway_deployment" "deployment" {
      ~ created_date      = "2020-09-06T14:32:06Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-east-1:656889719924:twevug835e/bootstrap" -> (known after apply)
      ~ id                = "y4zlgw" -> (known after apply)
      ~ invoke_url        = "https://twevug835e.execute-api.us-east-1.amazonaws.com/bootstrap" -> (known after apply)
      ~ rest_api_id       = "twevug835e" -> (known after apply) # forces replacement
        stage_description = "A basic stage created to remediate a race condition in API Gateway"
        stage_name        = "bootstrap"
      ~ triggers          = {
          - "redeployment" = "d52859c8ed19bc32d43aaafe4be328a790370cef"
        } -> (known after apply) # forces replacement
    }

  # module.serverless_api["example"].module.stage["live"].aws_api_gateway_gateway_response.response_cors will be created
  + resource "aws_api_gateway_gateway_response" "response_cors" {
      + id                  = (known after apply)
      + response_parameters = {
          + "gatewayresponse.header.Access-Control-Allow-Headers" = "'*'"
          + "gatewayresponse.header.Access-Control-Allow-Methods" = "'*'"
          + "gatewayresponse.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + response_templates  = {
          + "application/json" = "{\"message\":$context.error.messageString}"
        }
      + response_type       = "DEFAULT_4XX"
      + rest_api_id         = (known after apply)
    }

  # module.serverless_api["example"].module.stage["live"].aws_api_gateway_integration.health_get will be created
  + resource "aws_api_gateway_integration" "health_get" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "GET"
      + id                   = (known after apply)
      + passthrough_behavior = (known after apply)
      + request_templates    = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id          = (known after apply)
      + rest_api_id          = (known after apply)
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # module.serverless_api["example"].module.stage["live"].aws_api_gateway_integration_response.health_get_response_200 will be created
  + resource "aws_api_gateway_integration_response" "health_get_response_200" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'GET'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + response_templates  = {
          + "application/json" = ""
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.serverless_api["example"].module.stage["live"].aws_api_gateway_method.health_get will be created
  + resource "aws_api_gateway_method" "health_get" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.serverless_api["example"].module.stage["live"].aws_api_gateway_method_response.health_get_response_200 will be created
  + resource "aws_api_gateway_method_response" "health_get_response_200" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.serverless_api["example"].module.stage["live"].aws_api_gateway_method_settings.settings will be created
  + resource "aws_api_gateway_method_settings" "settings" {
      + id          = (known after apply)
      + method_path = "*/*"
      + rest_api_id = (known after apply)
      + stage_name  = "live"

      + settings {
          + cache_data_encrypted                       = (known after apply)
          + cache_ttl_in_seconds                       = (known after apply)
          + caching_enabled                            = (known after apply)
          + data_trace_enabled                         = true
          + logging_level                              = "INFO"
          + metrics_enabled                            = true
          + require_authorization_for_cache_control    = (known after apply)
          + throttling_burst_limit                     = -1
          + throttling_rate_limit                      = -1
          + unauthorized_cache_control_header_strategy = (known after apply)
        }
    }

  # module.serverless_api["example"].module.stage["live"].aws_api_gateway_resource.health will be created
  + resource "aws_api_gateway_resource" "health" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "health"
      + rest_api_id = (known after apply)
    }

  # module.serverless_api["example"].module.stage["live"].aws_api_gateway_rest_api.api will be created
  + resource "aws_api_gateway_rest_api" "api" {
      + api_key_source           = "HEADER"
      + arn                      = (known after apply)
      + created_date             = (known after apply)
      + execution_arn            = (known after apply)
      + id                       = (known after apply)
      + minimum_compression_size = -1
      + name                     = "example-live"
      + root_resource_id         = (known after apply)

      + endpoint_configuration {
          + types            = (known after apply)
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # module.serverless_api["example"].module.stage["live"].aws_api_gateway_stage.stage will be created
  + resource "aws_api_gateway_stage" "stage" {
      + arn                  = (known after apply)
      + deployment_id        = (known after apply)
      + execution_arn        = (known after apply)
      + id                   = (known after apply)
      + invoke_url           = (known after apply)
      + rest_api_id          = (known after apply)
      + stage_name           = "live"
      + xray_tracing_enabled = true

      + access_log_settings {
          + destination_arn = "arn:aws:logs:us-east-1:656889719924:log-group:/aws/apigateway/example-live-access-logs"
          + format          = "$context.identity.sourceIp $context.identity.caller $context.identity.user [$context.requestTime] \"$context.httpMethod $context.resourcePath $context.protocol\" $context.status $context.responseLength $context.requestId"
        }
    }

  # module.serverless_api["example"].module.stage["live"].aws_cloudwatch_log_group.execution_group must be replaced
-/+ resource "aws_cloudwatch_log_group" "execution_group" {
      ~ arn               = "arn:aws:logs:us-east-1:656889719924:log-group:API-Gateway-Execution-Logs_twevug835e/live" -> (known after apply)
      ~ id                = "API-Gateway-Execution-Logs_twevug835e/live" -> (known after apply)
      ~ name              = "API-Gateway-Execution-Logs_twevug835e/live" -> (known after apply) # forces replacement
        retention_in_days = 0
      - tags              = {} -> null
    }

  # module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_base_path_mapping.mapping will be created
  + resource "aws_api_gateway_base_path_mapping" "mapping" {
      + api_id      = (known after apply)
      + base_path   = "example"
      + domain_name = "api.scaffoldly.dev"
      + id          = (known after apply)
      + stage_name  = "nonlive"
    }

  # module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_deployment.deployment must be replaced
+/- resource "aws_api_gateway_deployment" "deployment" {
      ~ created_date      = "2020-09-06T14:32:06Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-east-1:656889719924:fghfrn4x2b/bootstrap" -> (known after apply)
      ~ id                = "qh1vo4" -> (known after apply)
      ~ invoke_url        = "https://fghfrn4x2b.execute-api.us-east-1.amazonaws.com/bootstrap" -> (known after apply)
      ~ rest_api_id       = "fghfrn4x2b" -> (known after apply) # forces replacement
        stage_description = "A basic stage created to remediate a race condition in API Gateway"
        stage_name        = "bootstrap"
      ~ triggers          = {
          - "redeployment" = "6dfa182c13e926a118ab5f3ce9afba8f6ab4ee17"
        } -> (known after apply) # forces replacement
    }

  # module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_gateway_response.response_cors will be created
  + resource "aws_api_gateway_gateway_response" "response_cors" {
      + id                  = (known after apply)
      + response_parameters = {
          + "gatewayresponse.header.Access-Control-Allow-Headers" = "'*'"
          + "gatewayresponse.header.Access-Control-Allow-Methods" = "'*'"
          + "gatewayresponse.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + response_templates  = {
          + "application/json" = "{\"message\":$context.error.messageString}"
        }
      + response_type       = "DEFAULT_4XX"
      + rest_api_id         = (known after apply)
    }

  # module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_integration.health_get will be created
  + resource "aws_api_gateway_integration" "health_get" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "GET"
      + id                   = (known after apply)
      + passthrough_behavior = (known after apply)
      + request_templates    = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id          = (known after apply)
      + rest_api_id          = (known after apply)
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_integration_response.health_get_response_200 will be created
  + resource "aws_api_gateway_integration_response" "health_get_response_200" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'GET'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + response_templates  = {
          + "application/json" = ""
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_method.health_get will be created
  + resource "aws_api_gateway_method" "health_get" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_method_response.health_get_response_200 will be created
  + resource "aws_api_gateway_method_response" "health_get_response_200" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_method_settings.settings will be created
  + resource "aws_api_gateway_method_settings" "settings" {
      + id          = (known after apply)
      + method_path = "*/*"
      + rest_api_id = (known after apply)
      + stage_name  = "nonlive"

      + settings {
          + cache_data_encrypted                       = (known after apply)
          + cache_ttl_in_seconds                       = (known after apply)
          + caching_enabled                            = (known after apply)
          + data_trace_enabled                         = true
          + logging_level                              = "INFO"
          + metrics_enabled                            = true
          + require_authorization_for_cache_control    = (known after apply)
          + throttling_burst_limit                     = -1
          + throttling_rate_limit                      = -1
          + unauthorized_cache_control_header_strategy = (known after apply)
        }
    }

  # module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_resource.health will be created
  + resource "aws_api_gateway_resource" "health" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "health"
      + rest_api_id = (known after apply)
    }

  # module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_rest_api.api will be created
  + resource "aws_api_gateway_rest_api" "api" {
      + api_key_source           = "HEADER"
      + arn                      = (known after apply)
      + created_date             = (known after apply)
      + execution_arn            = (known after apply)
      + id                       = (known after apply)
      + minimum_compression_size = -1
      + name                     = "example-nonlive"
      + root_resource_id         = (known after apply)

      + endpoint_configuration {
          + types            = (known after apply)
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_stage.stage will be created
  + resource "aws_api_gateway_stage" "stage" {
      + arn                  = (known after apply)
      + deployment_id        = (known after apply)
      + execution_arn        = (known after apply)
      + id                   = (known after apply)
      + invoke_url           = (known after apply)
      + rest_api_id          = (known after apply)
      + stage_name           = "nonlive"
      + xray_tracing_enabled = true

      + access_log_settings {
          + destination_arn = "arn:aws:logs:us-east-1:656889719924:log-group:/aws/apigateway/example-nonlive-access-logs"
          + format          = "$context.identity.sourceIp $context.identity.caller $context.identity.user [$context.requestTime] \"$context.httpMethod $context.resourcePath $context.protocol\" $context.status $context.responseLength $context.requestId"
        }
    }

  # module.serverless_api["example"].module.stage["nonlive"].aws_cloudwatch_log_group.execution_group must be replaced
-/+ resource "aws_cloudwatch_log_group" "execution_group" {
      ~ arn               = "arn:aws:logs:us-east-1:656889719924:log-group:API-Gateway-Execution-Logs_fghfrn4x2b/nonlive" -> (known after apply)
      ~ id                = "API-Gateway-Execution-Logs_fghfrn4x2b/nonlive" -> (known after apply)
      ~ name              = "API-Gateway-Execution-Logs_fghfrn4x2b/nonlive" -> (known after apply) # forces replacement
        retention_in_days = 0
      - tags              = {} -> null
    }

Plan: 24 to add, 0 to change, 4 to destroy.

------------------------------------------------------------------------

This plan was saved to: planfile

To perform exactly these actions, run the following command to apply:
    terraform apply "planfile"

\n\n0
```